GopalSaraf/Practicals/PSDL/include/proc/pic18lf67k40.h
extern volatile SSP1SSPPSbits_t SSP1SSPPSbits __at(0xE1B);
// bitfield macros
#define _SSP1SSPPS_PIN_POSN                                 0x0
#define _SSP1SSPPS_PIN_POSITION                             0x0
#define _SSP1SSPPS_PIN_SIZE                                 0x3
#define _SSP1SSPPS_PIN_LENGTH                               0x3
#define _SSP1SSPPS_PIN_MASK                                 0x7
#define _SSP1SSPPS_PORT_POSN                                0x3
#define _SSP1SSPPS_PORT_POSITION                            0x3
#define _SSP1SSPPS_PORT_SIZE                                0x3
#define _SSP1SSPPS_PORT_LENGTH                              0x3
#define _SSP1SSPPS_PORT_MASK                                0x38
#define _SSP1SSPPS_SSP1SSPPS_POSN                           0x0
#define _SSP1SSPPS_SSP1SSPPS_POSITION                       0x0
#define _SSP1SSPPS_SSP1SSPPS_SIZE                           0x6
#define _SSP1SSPPS_SSP1SSPPS_LENGTH                         0x6
#define _SSP1SSPPS_SSP1SSPPS_MASK                           0x3F
#define _SSP1SSPPS_SSP1SSPPS0_POSN                          0x0
#define _SSP1SSPPS_SSP1SSPPS0_POSITION                      0x0
#define _SSP1SSPPS_SSP1SSPPS0_SIZE                          0x1
#define _SSP1SSPPS_SSP1SSPPS0_LENGTH                        0x1
#define _SSP1SSPPS_SSP1SSPPS0_MASK                          0x1
#define _SSP1SSPPS_SSP1SSPPS1_POSN                          0x1
#define _SSP1SSPPS_SSP1SSPPS1_POSITION                      0x1
#define _SSP1SSPPS_SSP1SSPPS1_SIZE                          0x1
#define _SSP1SSPPS_SSP1SSPPS1_LENGTH                        0x1
#define _SSP1SSPPS_SSP1SSPPS1_MASK                          0x2
#define _SSP1SSPPS_SSP1SSPPS2_POSN                          0x2
#define _SSP1SSPPS_SSP1SSPPS2_POSITION                      0x2
#define _SSP1SSPPS_SSP1SSPPS2_SIZE                          0x1
#define _SSP1SSPPS_SSP1SSPPS2_LENGTH                        0x1
#define _SSP1SSPPS_SSP1SSPPS2_MASK                          0x4
#define _SSP1SSPPS_SSP1SSPPS3_POSN                          0x3
#define _SSP1SSPPS_SSP1SSPPS3_POSITION                      0x3
#define _SSP1SSPPS_SSP1SSPPS3_SIZE                          0x1
#define _SSP1SSPPS_SSP1SSPPS3_LENGTH                        0x1
#define _SSP1SSPPS_SSP1SSPPS3_MASK                          0x8
#define _SSP1SSPPS_SSP1SSPPS4_POSN                          0x4
#define _SSP1SSPPS_SSP1SSPPS4_POSITION                      0x4
#define _SSP1SSPPS_SSP1SSPPS4_SIZE                          0x1
#define _SSP1SSPPS_SSP1SSPPS4_LENGTH                        0x1
#define _SSP1SSPPS_SSP1SSPPS4_MASK                          0x10
#define _SSP1SSPPS_SSP1SSPPS5_POSN                          0x5
#define _SSP1SSPPS_SSP1SSPPS5_POSITION                      0x5
#define _SSP1SSPPS_SSP1SSPPS5_SIZE                          0x1
#define _SSP1SSPPS_SSP1SSPPS5_LENGTH                        0x1
#define _SSP1SSPPS_SSP1SSPPS5_MASK                          0x20

// Register: SSP2CLKPPS
#define SSP2CLKPPS SSP2CLKPPS
extern volatile unsigned char           SSP2CLKPPS          __at(0xE1C);
#ifndef _LIB_BUILD
asm("SSP2CLKPPS equ 0E1Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned SSP2CLKPPS             :6;
    };
    struct {
        unsigned SSP2CLKPPS0            :1;
        unsigned SSP2CLKPPS1            :1;
        unsigned SSP2CLKPPS2            :1;
        unsigned SSP2CLKPPS3            :1;
        unsigned SSP2CLKPPS4            :1;
    };
} SSP2CLKPPSbits_t;
extern volatile SSP2CLKPPSbits_t SSP2CLKPPSbits __at(0xE1C);
// bitfield macros
#define _SSP2CLKPPS_PIN_POSN                                0x0
#define _SSP2CLKPPS_PIN_POSITION                            0x0
#define _SSP2CLKPPS_PIN_SIZE                                0x3
#define _SSP2CLKPPS_PIN_LENGTH                              0x3
#define _SSP2CLKPPS_PIN_MASK                                0x7
#define _SSP2CLKPPS_PORT_POSN                               0x3
#define _SSP2CLKPPS_PORT_POSITION                           0x3
#define _SSP2CLKPPS_PORT_SIZE                               0x2
#define _SSP2CLKPPS_PORT_LENGTH                             0x2
#define _SSP2CLKPPS_PORT_MASK                               0x18
#define _SSP2CLKPPS_SSP2CLKPPS_POSN                         0x0
#define _SSP2CLKPPS_SSP2CLKPPS_POSITION                     0x0
#define _SSP2CLKPPS_SSP2CLKPPS_SIZE                         0x6
#define _SSP2CLKPPS_SSP2CLKPPS_LENGTH                       0x6
#define _SSP2CLKPPS_SSP2CLKPPS_MASK                         0x3F
#define _SSP2CLKPPS_SSP2CLKPPS0_POSN                        0x0
#define _SSP2CLKPPS_SSP2CLKPPS0_POSITION                    0x0
#define _SSP2CLKPPS_SSP2CLKPPS0_SIZE                        0x1
#define _SSP2CLKPPS_SSP2CLKPPS0_LENGTH                      0x1
#define _SSP2CLKPPS_SSP2CLKPPS0_MASK                        0x1
#define _SSP2CLKPPS_SSP2CLKPPS1_POSN                        0x1
#define _SSP2CLKPPS_SSP2CLKPPS1_POSITION                    0x1
#define _SSP2CLKPPS_SSP2CLKPPS1_SIZE                        0x1
#define _SSP2CLKPPS_SSP2CLKPPS1_LENGTH                      0x1
#define _SSP2CLKPPS_SSP2CLKPPS1_MASK                        0x2
#define _SSP2CLKPPS_SSP2CLKPPS2_POSN                        0x2
#define _SSP2CLKPPS_SSP2CLKPPS2_POSITION                    0x2
#define _SSP2CLKPPS_SSP2CLKPPS2_SIZE                        0x1
#define _SSP2CLKPPS_SSP2CLKPPS2_LENGTH                      0x1
#define _SSP2CLKPPS_SSP2CLKPPS2_MASK                        0x4
#define _SSP2CLKPPS_SSP2CLKPPS3_POSN                        0x3
#define _SSP2CLKPPS_SSP2CLKPPS3_POSITION                    0x3
#define _SSP2CLKPPS_SSP2CLKPPS3_SIZE                        0x1
#define _SSP2CLKPPS_SSP2CLKPPS3_LENGTH                      0x1
#define _SSP2CLKPPS_SSP2CLKPPS3_MASK                        0x8
#define _SSP2CLKPPS_SSP2CLKPPS4_POSN                        0x4
#define _SSP2CLKPPS_SSP2CLKPPS4_POSITION                    0x4
#define _SSP2CLKPPS_SSP2CLKPPS4_SIZE                        0x1
#define _SSP2CLKPPS_SSP2CLKPPS4_LENGTH                      0x1
#define _SSP2CLKPPS_SSP2CLKPPS4_MASK                        0x10

// Register: SSP2DATPPS
#define SSP2DATPPS SSP2DATPPS
extern volatile unsigned char           SSP2DATPPS          __at(0xE1D);
#ifndef _LIB_BUILD
asm("SSP2DATPPS equ 0E1Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned SSP2DATPPS             :6;
    };
    struct {
        unsigned SSP2DATPPS0            :1;
        unsigned SSP2DATPPS1            :1;
        unsigned SSP2DATPPS2            :1;
        unsigned SSP2DATPPS3            :1;
        unsigned SSP2DATPPS4            :1;
    };
} SSP2DATPPSbits_t;
extern volatile SSP2DATPPSbits_t SSP2DATPPSbits __at(0xE1D);
// bitfield macros
#define _SSP2DATPPS_PIN_POSN                                0x0
#define _SSP2DATPPS_PIN_POSITION                            0x0
#define _SSP2DATPPS_PIN_SIZE                                0x3
#define _SSP2DATPPS_PIN_LENGTH                              0x3
#define _SSP2DATPPS_PIN_MASK                                0x7
#define _SSP2DATPPS_PORT_POSN                               0x3
#define _SSP2DATPPS_PORT_POSITION                           0x3
#define _SSP2DATPPS_PORT_SIZE                               0x2
#define _SSP2DATPPS_PORT_LENGTH                             0x2
#define _SSP2DATPPS_PORT_MASK                               0x18
#define _SSP2DATPPS_SSP2DATPPS_POSN                         0x0
#define _SSP2DATPPS_SSP2DATPPS_POSITION                     0x0
#define _SSP2DATPPS_SSP2DATPPS_SIZE                         0x6
#define _SSP2DATPPS_SSP2DATPPS_LENGTH                       0x6
#define _SSP2DATPPS_SSP2DATPPS_MASK                         0x3F
#define _SSP2DATPPS_SSP2DATPPS0_POSN                        0x0
#define _SSP2DATPPS_SSP2DATPPS0_POSITION                    0x0
#define _SSP2DATPPS_SSP2DATPPS0_SIZE                        0x1
#define _SSP2DATPPS_SSP2DATPPS0_LENGTH                      0x1
#define _SSP2DATPPS_SSP2DATPPS0_MASK                        0x1
#define _SSP2DATPPS_SSP2DATPPS1_POSN                        0x1
#define _SSP2DATPPS_SSP2DATPPS1_POSITION                    0x1
#define _SSP2DATPPS_SSP2DATPPS1_SIZE                        0x1
#define _SSP2DATPPS_SSP2DATPPS1_LENGTH                      0x1
#define _SSP2DATPPS_SSP2DATPPS1_MASK                        0x2
#define _SSP2DATPPS_SSP2DATPPS2_POSN                        0x2
#define _SSP2DATPPS_SSP2DATPPS2_POSITION                    0x2
#define _SSP2DATPPS_SSP2DATPPS2_SIZE                        0x1
#define _SSP2DATPPS_SSP2DATPPS2_LENGTH                      0x1
#define _SSP2DATPPS_SSP2DATPPS2_MASK                        0x4
#define _SSP2DATPPS_SSP2DATPPS3_POSN                        0x3
#define _SSP2DATPPS_SSP2DATPPS3_POSITION                    0x3
#define _SSP2DATPPS_SSP2DATPPS3_SIZE                        0x1
#define _SSP2DATPPS_SSP2DATPPS3_LENGTH                      0x1
#define _SSP2DATPPS_SSP2DATPPS3_MASK                        0x8
#define _SSP2DATPPS_SSP2DATPPS4_POSN                        0x4
#define _SSP2DATPPS_SSP2DATPPS4_POSITION                    0x4
#define _SSP2DATPPS_SSP2DATPPS4_SIZE                        0x1
#define _SSP2DATPPS_SSP2DATPPS4_LENGTH                      0x1
#define _SSP2DATPPS_SSP2DATPPS4_MASK                        0x10

// Register: SSP2SSPPS
#define SSP2SSPPS SSP2SSPPS
extern volatile unsigned char           SSP2SSPPS           __at(0xE1E);
#ifndef _LIB_BUILD
asm("SSP2SSPPS equ 0E1Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned SSP2SSPPS              :6;
    };
    struct {
        unsigned SSP2SSPPS0             :1;
        unsigned SSP2SSPPS1             :1;
        unsigned SSP2SSPPS2             :1;
        unsigned SSP2SSPPS3             :1;
        unsigned SSP2SSPPS4             :1;
    };
} SSP2SSPPSbits_t;
extern volatile SSP2SSPPSbits_t SSP2SSPPSbits __at(0xE1E);
// bitfield macros
#define _SSP2SSPPS_PIN_POSN                                 0x0
#define _SSP2SSPPS_PIN_POSITION                             0x0
#define _SSP2SSPPS_PIN_SIZE                                 0x3
#define _SSP2SSPPS_PIN_LENGTH                               0x3
#define _SSP2SSPPS_PIN_MASK                                 0x7
#define _SSP2SSPPS_PORT_POSN                                0x3
#define _SSP2SSPPS_PORT_POSITION                            0x3
#define _SSP2SSPPS_PORT_SIZE                                0x2
#define _SSP2SSPPS_PORT_LENGTH                              0x2
#define _SSP2SSPPS_PORT_MASK                                0x18
#define _SSP2SSPPS_SSP2SSPPS_POSN                           0x0
#define _SSP2SSPPS_SSP2SSPPS_POSITION                       0x0
#define _SSP2SSPPS_SSP2SSPPS_SIZE                           0x6
#define _SSP2SSPPS_SSP2SSPPS_LENGTH                         0x6
#define _SSP2SSPPS_SSP2SSPPS_MASK                           0x3F
#define _SSP2SSPPS_SSP2SSPPS0_POSN                          0x0
#define _SSP2SSPPS_SSP2SSPPS0_POSITION                      0x0
#define _SSP2SSPPS_SSP2SSPPS0_SIZE                          0x1
#define _SSP2SSPPS_SSP2SSPPS0_LENGTH                        0x1
#define _SSP2SSPPS_SSP2SSPPS0_MASK                          0x1
#define _SSP2SSPPS_SSP2SSPPS1_POSN                          0x1
#define _SSP2SSPPS_SSP2SSPPS1_POSITION                      0x1
#define _SSP2SSPPS_SSP2SSPPS1_SIZE                          0x1
#define _SSP2SSPPS_SSP2SSPPS1_LENGTH                        0x1
#define _SSP2SSPPS_SSP2SSPPS1_MASK                          0x2
#define _SSP2SSPPS_SSP2SSPPS2_POSN                          0x2
#define _SSP2SSPPS_SSP2SSPPS2_POSITION                      0x2
#define _SSP2SSPPS_SSP2SSPPS2_SIZE                          0x1
#define _SSP2SSPPS_SSP2SSPPS2_LENGTH                        0x1
#define _SSP2SSPPS_SSP2SSPPS2_MASK                          0x4
#define _SSP2SSPPS_SSP2SSPPS3_POSN                          0x3
#define _SSP2SSPPS_SSP2SSPPS3_POSITION                      0x3
#define _SSP2SSPPS_SSP2SSPPS3_SIZE                          0x1
#define _SSP2SSPPS_SSP2SSPPS3_LENGTH                        0x1
#define _SSP2SSPPS_SSP2SSPPS3_MASK                          0x8
#define _SSP2SSPPS_SSP2SSPPS4_POSN                          0x4
#define _SSP2SSPPS_SSP2SSPPS4_POSITION                      0x4
#define _SSP2SSPPS_SSP2SSPPS4_SIZE                          0x1
#define _SSP2SSPPS_SSP2SSPPS4_LENGTH                        0x1
#define _SSP2SSPPS_SSP2SSPPS4_MASK                          0x10

// Register: IPR0
#define IPR0 IPR0
extern volatile unsigned char           IPR0                __at(0xE1F);
#ifndef _LIB_BUILD
asm("IPR0 equ 0E1Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT0IP                 :1;
        unsigned INT1IP                 :1;
        unsigned INT2IP                 :1;
        unsigned INT3IP                 :1;
        unsigned IOCIP                  :1;
        unsigned TMR0IP                 :1;
    };
} IPR0bits_t;
