GopalSaraf/Practicals/PSDL/include/proc/pic18lf67k40.h
extern volatile RF7PPSbits_t RF7PPSbits __at(0xE81);
// bitfield macros
#define _RF7PPS_RF7PPS0_POSN                                0x0
#define _RF7PPS_RF7PPS0_POSITION                            0x0
#define _RF7PPS_RF7PPS0_SIZE                                0x1
#define _RF7PPS_RF7PPS0_LENGTH                              0x1
#define _RF7PPS_RF7PPS0_MASK                                0x1
#define _RF7PPS_RF7PPS1_POSN                                0x1
#define _RF7PPS_RF7PPS1_POSITION                            0x1
#define _RF7PPS_RF7PPS1_SIZE                                0x1
#define _RF7PPS_RF7PPS1_LENGTH                              0x1
#define _RF7PPS_RF7PPS1_MASK                                0x2
#define _RF7PPS_RF7PPS2_POSN                                0x2
#define _RF7PPS_RF7PPS2_POSITION                            0x2
#define _RF7PPS_RF7PPS2_SIZE                                0x1
#define _RF7PPS_RF7PPS2_LENGTH                              0x1
#define _RF7PPS_RF7PPS2_MASK                                0x4
#define _RF7PPS_RF7PPS3_POSN                                0x3
#define _RF7PPS_RF7PPS3_POSITION                            0x3
#define _RF7PPS_RF7PPS3_SIZE                                0x1
#define _RF7PPS_RF7PPS3_LENGTH                              0x1
#define _RF7PPS_RF7PPS3_MASK                                0x8
#define _RF7PPS_RF7PPS4_POSN                                0x4
#define _RF7PPS_RF7PPS4_POSITION                            0x4
#define _RF7PPS_RF7PPS4_SIZE                                0x1
#define _RF7PPS_RF7PPS4_LENGTH                              0x1
#define _RF7PPS_RF7PPS4_MASK                                0x10
#define _RF7PPS_RF7PPS5_POSN                                0x5
#define _RF7PPS_RF7PPS5_POSITION                            0x5
#define _RF7PPS_RF7PPS5_SIZE                                0x1
#define _RF7PPS_RF7PPS5_LENGTH                              0x1
#define _RF7PPS_RF7PPS5_MASK                                0x20

// Register: RG0PPS
#define RG0PPS RG0PPS
extern volatile unsigned char           RG0PPS              __at(0xE82);
#ifndef _LIB_BUILD
asm("RG0PPS equ 0E82h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RG0PPS0                :1;
        unsigned RG0PPS1                :1;
        unsigned RG0PPS2                :1;
        unsigned RG0PPS3                :1;
        unsigned RG0PPS4                :1;
        unsigned RG0PPS5                :1;
    };
} RG0PPSbits_t;
extern volatile RG0PPSbits_t RG0PPSbits __at(0xE82);
// bitfield macros
#define _RG0PPS_RG0PPS0_POSN                                0x0
#define _RG0PPS_RG0PPS0_POSITION                            0x0
#define _RG0PPS_RG0PPS0_SIZE                                0x1
#define _RG0PPS_RG0PPS0_LENGTH                              0x1
#define _RG0PPS_RG0PPS0_MASK                                0x1
#define _RG0PPS_RG0PPS1_POSN                                0x1
#define _RG0PPS_RG0PPS1_POSITION                            0x1
#define _RG0PPS_RG0PPS1_SIZE                                0x1
#define _RG0PPS_RG0PPS1_LENGTH                              0x1
#define _RG0PPS_RG0PPS1_MASK                                0x2
#define _RG0PPS_RG0PPS2_POSN                                0x2
#define _RG0PPS_RG0PPS2_POSITION                            0x2
#define _RG0PPS_RG0PPS2_SIZE                                0x1
#define _RG0PPS_RG0PPS2_LENGTH                              0x1
#define _RG0PPS_RG0PPS2_MASK                                0x4
#define _RG0PPS_RG0PPS3_POSN                                0x3
#define _RG0PPS_RG0PPS3_POSITION                            0x3
#define _RG0PPS_RG0PPS3_SIZE                                0x1
#define _RG0PPS_RG0PPS3_LENGTH                              0x1
#define _RG0PPS_RG0PPS3_MASK                                0x8
#define _RG0PPS_RG0PPS4_POSN                                0x4
#define _RG0PPS_RG0PPS4_POSITION                            0x4
#define _RG0PPS_RG0PPS4_SIZE                                0x1
#define _RG0PPS_RG0PPS4_LENGTH                              0x1
#define _RG0PPS_RG0PPS4_MASK                                0x10
#define _RG0PPS_RG0PPS5_POSN                                0x5
#define _RG0PPS_RG0PPS5_POSITION                            0x5
#define _RG0PPS_RG0PPS5_SIZE                                0x1
#define _RG0PPS_RG0PPS5_LENGTH                              0x1
#define _RG0PPS_RG0PPS5_MASK                                0x20

// Register: RG1PPS
#define RG1PPS RG1PPS
extern volatile unsigned char           RG1PPS              __at(0xE83);
#ifndef _LIB_BUILD
asm("RG1PPS equ 0E83h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RG1PPS0                :1;
        unsigned RG1PPS1                :1;
        unsigned RG1PPS2                :1;
        unsigned RG1PPS3                :1;
        unsigned RG1PPS4                :1;
        unsigned RG1PPS5                :1;
    };
} RG1PPSbits_t;
extern volatile RG1PPSbits_t RG1PPSbits __at(0xE83);
// bitfield macros
#define _RG1PPS_RG1PPS0_POSN                                0x0
#define _RG1PPS_RG1PPS0_POSITION                            0x0
#define _RG1PPS_RG1PPS0_SIZE                                0x1
#define _RG1PPS_RG1PPS0_LENGTH                              0x1
#define _RG1PPS_RG1PPS0_MASK                                0x1
#define _RG1PPS_RG1PPS1_POSN                                0x1
#define _RG1PPS_RG1PPS1_POSITION                            0x1
#define _RG1PPS_RG1PPS1_SIZE                                0x1
#define _RG1PPS_RG1PPS1_LENGTH                              0x1
#define _RG1PPS_RG1PPS1_MASK                                0x2
#define _RG1PPS_RG1PPS2_POSN                                0x2
#define _RG1PPS_RG1PPS2_POSITION                            0x2
#define _RG1PPS_RG1PPS2_SIZE                                0x1
#define _RG1PPS_RG1PPS2_LENGTH                              0x1
#define _RG1PPS_RG1PPS2_MASK                                0x4
#define _RG1PPS_RG1PPS3_POSN                                0x3
#define _RG1PPS_RG1PPS3_POSITION                            0x3
#define _RG1PPS_RG1PPS3_SIZE                                0x1
#define _RG1PPS_RG1PPS3_LENGTH                              0x1
#define _RG1PPS_RG1PPS3_MASK                                0x8
#define _RG1PPS_RG1PPS4_POSN                                0x4
#define _RG1PPS_RG1PPS4_POSITION                            0x4
#define _RG1PPS_RG1PPS4_SIZE                                0x1
#define _RG1PPS_RG1PPS4_LENGTH                              0x1
#define _RG1PPS_RG1PPS4_MASK                                0x10
#define _RG1PPS_RG1PPS5_POSN                                0x5
#define _RG1PPS_RG1PPS5_POSITION                            0x5
#define _RG1PPS_RG1PPS5_SIZE                                0x1
#define _RG1PPS_RG1PPS5_LENGTH                              0x1
#define _RG1PPS_RG1PPS5_MASK                                0x20

// Register: RG2PPS
#define RG2PPS RG2PPS
extern volatile unsigned char           RG2PPS              __at(0xE84);
#ifndef _LIB_BUILD
asm("RG2PPS equ 0E84h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RG2PPS0                :1;
        unsigned RG2PPS1                :1;
        unsigned RG2PPS2                :1;
        unsigned RG2PPS3                :1;
        unsigned RG2PPS4                :1;
        unsigned RG2PPS5                :1;
    };
} RG2PPSbits_t;
