GopalSaraf/Practicals/PSDL/include/proc/pic18lf67k40.h
extern volatile CCPTMRS0bits_t CCPTMRS0bits __at(0xFAD);
// bitfield macros
#define _CCPTMRS0_C1TSEL0_POSN                              0x0
#define _CCPTMRS0_C1TSEL0_POSITION                          0x0
#define _CCPTMRS0_C1TSEL0_SIZE                              0x1
#define _CCPTMRS0_C1TSEL0_LENGTH                            0x1
#define _CCPTMRS0_C1TSEL0_MASK                              0x1
#define _CCPTMRS0_C1TSEL1_POSN                              0x1
#define _CCPTMRS0_C1TSEL1_POSITION                          0x1
#define _CCPTMRS0_C1TSEL1_SIZE                              0x1
#define _CCPTMRS0_C1TSEL1_LENGTH                            0x1
#define _CCPTMRS0_C1TSEL1_MASK                              0x2
#define _CCPTMRS0_C2TSEL0_POSN                              0x2
#define _CCPTMRS0_C2TSEL0_POSITION                          0x2
#define _CCPTMRS0_C2TSEL0_SIZE                              0x1
#define _CCPTMRS0_C2TSEL0_LENGTH                            0x1
#define _CCPTMRS0_C2TSEL0_MASK                              0x4
#define _CCPTMRS0_C2TSEL1_POSN                              0x3
#define _CCPTMRS0_C2TSEL1_POSITION                          0x3
#define _CCPTMRS0_C2TSEL1_SIZE                              0x1
#define _CCPTMRS0_C2TSEL1_LENGTH                            0x1
#define _CCPTMRS0_C2TSEL1_MASK                              0x8
#define _CCPTMRS0_C3TSEL0_POSN                              0x4
#define _CCPTMRS0_C3TSEL0_POSITION                          0x4
#define _CCPTMRS0_C3TSEL0_SIZE                              0x1
#define _CCPTMRS0_C3TSEL0_LENGTH                            0x1
#define _CCPTMRS0_C3TSEL0_MASK                              0x10
#define _CCPTMRS0_C3TSEL1_POSN                              0x5
#define _CCPTMRS0_C3TSEL1_POSITION                          0x5
#define _CCPTMRS0_C3TSEL1_SIZE                              0x1
#define _CCPTMRS0_C3TSEL1_LENGTH                            0x1
#define _CCPTMRS0_C3TSEL1_MASK                              0x20
#define _CCPTMRS0_C4TSEL0_POSN                              0x6
#define _CCPTMRS0_C4TSEL0_POSITION                          0x6
#define _CCPTMRS0_C4TSEL0_SIZE                              0x1
#define _CCPTMRS0_C4TSEL0_LENGTH                            0x1
#define _CCPTMRS0_C4TSEL0_MASK                              0x40
#define _CCPTMRS0_C4TSEL1_POSN                              0x7
#define _CCPTMRS0_C4TSEL1_POSITION                          0x7
#define _CCPTMRS0_C4TSEL1_SIZE                              0x1
#define _CCPTMRS0_C4TSEL1_LENGTH                            0x1
#define _CCPTMRS0_C4TSEL1_MASK                              0x80
#define _CCPTMRS0_C1TSEL_POSN                               0x0
#define _CCPTMRS0_C1TSEL_POSITION                           0x0
#define _CCPTMRS0_C1TSEL_SIZE                               0x2
#define _CCPTMRS0_C1TSEL_LENGTH                             0x2
#define _CCPTMRS0_C1TSEL_MASK                               0x3
#define _CCPTMRS0_C2TSEL_POSN                               0x2
#define _CCPTMRS0_C2TSEL_POSITION                           0x2
#define _CCPTMRS0_C2TSEL_SIZE                               0x2
#define _CCPTMRS0_C2TSEL_LENGTH                             0x2
#define _CCPTMRS0_C2TSEL_MASK                               0xC
#define _CCPTMRS0_C3TSEL_POSN                               0x4
#define _CCPTMRS0_C3TSEL_POSITION                           0x4
#define _CCPTMRS0_C3TSEL_SIZE                               0x2
#define _CCPTMRS0_C3TSEL_LENGTH                             0x2
#define _CCPTMRS0_C3TSEL_MASK                               0x30
#define _CCPTMRS0_C4TSEL_POSN                               0x6
#define _CCPTMRS0_C4TSEL_POSITION                           0x6
#define _CCPTMRS0_C4TSEL_SIZE                               0x2
#define _CCPTMRS0_C4TSEL_LENGTH                             0x2
#define _CCPTMRS0_C4TSEL_MASK                               0xC0

// Register: CCPTMRS1
#define CCPTMRS1 CCPTMRS1
extern volatile unsigned char           CCPTMRS1            __at(0xFAE);
#ifndef _LIB_BUILD
asm("CCPTMRS1 equ 0FAEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C5TSEL0                :1;
        unsigned C5TSEL1                :1;
        unsigned P6TSEL0                :1;
        unsigned P6TSEL1                :1;
        unsigned P7TSEL0                :1;
        unsigned P7TSEL1                :1;
    };
    struct {
        unsigned C5TSEL                 :2;
        unsigned P6TSEL                 :2;
        unsigned P7TSEL                 :2;
    };
} CCPTMRS1bits_t;
extern volatile CCPTMRS1bits_t CCPTMRS1bits __at(0xFAE);
// bitfield macros
#define _CCPTMRS1_C5TSEL0_POSN                              0x0
#define _CCPTMRS1_C5TSEL0_POSITION                          0x0
#define _CCPTMRS1_C5TSEL0_SIZE                              0x1
#define _CCPTMRS1_C5TSEL0_LENGTH                            0x1
#define _CCPTMRS1_C5TSEL0_MASK                              0x1
#define _CCPTMRS1_C5TSEL1_POSN                              0x1
#define _CCPTMRS1_C5TSEL1_POSITION                          0x1
#define _CCPTMRS1_C5TSEL1_SIZE                              0x1
#define _CCPTMRS1_C5TSEL1_LENGTH                            0x1
#define _CCPTMRS1_C5TSEL1_MASK                              0x2
#define _CCPTMRS1_P6TSEL0_POSN                              0x2
#define _CCPTMRS1_P6TSEL0_POSITION                          0x2
#define _CCPTMRS1_P6TSEL0_SIZE                              0x1
#define _CCPTMRS1_P6TSEL0_LENGTH                            0x1
#define _CCPTMRS1_P6TSEL0_MASK                              0x4
#define _CCPTMRS1_P6TSEL1_POSN                              0x3
#define _CCPTMRS1_P6TSEL1_POSITION                          0x3
#define _CCPTMRS1_P6TSEL1_SIZE                              0x1
#define _CCPTMRS1_P6TSEL1_LENGTH                            0x1
#define _CCPTMRS1_P6TSEL1_MASK                              0x8
#define _CCPTMRS1_P7TSEL0_POSN                              0x4
#define _CCPTMRS1_P7TSEL0_POSITION                          0x4
#define _CCPTMRS1_P7TSEL0_SIZE                              0x1
#define _CCPTMRS1_P7TSEL0_LENGTH                            0x1
#define _CCPTMRS1_P7TSEL0_MASK                              0x10
#define _CCPTMRS1_P7TSEL1_POSN                              0x5
#define _CCPTMRS1_P7TSEL1_POSITION                          0x5
#define _CCPTMRS1_P7TSEL1_SIZE                              0x1
#define _CCPTMRS1_P7TSEL1_LENGTH                            0x1
#define _CCPTMRS1_P7TSEL1_MASK                              0x20
#define _CCPTMRS1_C5TSEL_POSN                               0x0
#define _CCPTMRS1_C5TSEL_POSITION                           0x0
#define _CCPTMRS1_C5TSEL_SIZE                               0x2
#define _CCPTMRS1_C5TSEL_LENGTH                             0x2
#define _CCPTMRS1_C5TSEL_MASK                               0x3
#define _CCPTMRS1_P6TSEL_POSN                               0x2
#define _CCPTMRS1_P6TSEL_POSITION                           0x2
#define _CCPTMRS1_P6TSEL_SIZE                               0x2
#define _CCPTMRS1_P6TSEL_LENGTH                             0x2
#define _CCPTMRS1_P6TSEL_MASK                               0xC
#define _CCPTMRS1_P7TSEL_POSN                               0x4
#define _CCPTMRS1_P7TSEL_POSITION                           0x4
#define _CCPTMRS1_P7TSEL_SIZE                               0x2
#define _CCPTMRS1_P7TSEL_LENGTH                             0x2
#define _CCPTMRS1_P7TSEL_MASK                               0x30

// Register: T6TMR
#define T6TMR T6TMR
extern volatile unsigned char           T6TMR               __at(0xFAF);
#ifndef _LIB_BUILD
asm("T6TMR equ 0FAFh");
#endif
// aliases
extern volatile unsigned char           TMR6                __at(0xFAF);
#ifndef _LIB_BUILD
asm("TMR6 equ 0FAFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR                    :8;
    };
    struct {
        unsigned TMR6                   :8;
    };
} T6TMRbits_t;
